Qsq = 47520  # теплота сгорания, кДж/кг
Mg = 10000  # масса газа, кг
sigma = 4  # 7 - газовые, 4 - гетерогенные облака
P0 = 101325  # атм.давление, Па
c_st = 1  # концетрация стехиометрическая, кг/м3
c_g = 1  # концетрация газа, кг/м3
r = 135  # расстояние от центра взрыва, м
Vg = 150  # скорость фронта пламени, м/с
C0 = 340  # скорость звука, м/с

E = Mg * Qsq * (c_st / c_g) * ((sigma - 1) / sigma) * pow(10, 3)
Rx = r / pow(E / P0, 1 / 3)
print(E, Rx)

# Rx = 0.94
Px1 = pow(Vg / C0, 2) * ((sigma - 1) / sigma) * (0.83 / Rx - 0.14 / pow(Rx, 2))
Px2 = 0.125/Rx + 0.137/pow(Rx, 2) + 0.023/pow(Rx, 3)
Px = min(Px1,Px2)
dP = Px*P0/1000

if __name__ == '__main__':
    print(dP)
